Процедура ПроверитьПервыйЗапуск() Экспорт
	
	Если Константы.ПервыйЗапуск.Получить() = Ложь Тогда
		
		Константы.ПервыйЗапуск.Установить(Истина);
		
		ОбработатьДокументы();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДокументы()
	
	ТекМесяц = НачалоМесяца(ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Поступление.Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровИУслуг КАК Поступление
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поступление.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реализация.Ссылка
	|ИЗ
	|	Документ.ПродажаТоваров КАК Реализация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перемещение.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Перемещение.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПолучениеДенег.Ссылка
	|ИЗ
	|	Документ.ПолучениеДенежныхСредств КАК ПолучениеДенег
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолучениеДенег.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыплатаДенег.Ссылка
	|ИЗ
	|	Документ.ВыплатыДенежныхСредств КАК ВыплатаДенег
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыплатаДенег.МоментВремени УБЫВ";
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	//--Поступления--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[0].Выбрать();
	
	Разница = 5;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
			
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Реализации--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[1].Выбрать();
	
	Разница = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Перемещение--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[2].Выбрать();
	
	Разница = 3;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.1);
		
	КонецЦикла;
	
	
	//--Поступления денег--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[3].Выбрать();
	
	Разница = 3000;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;
	
	//--Выплаты денег--
	
	ВыборкаДетальныеЗаписи = МассивРезультатовЗапроса[4].Выбрать();
	
	Разница = 2000;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.Дата = ТекМесяц - Разница;
		
		Попытка
		
			Если ДокументОбъект.Проведен Тогда
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Иначе	
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		Разница = Разница + 24*60*60*(12.3);
		
	КонецЦикла;

КонецПроцедуры

