
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ВидОперации = Перечисления.ВидыОперацийПродажиТоваров.ВозвратСХранения Тогда
			
			Движение = Движения.Проводки.Добавить();
			//Нет счета Дебет!!!
			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
			
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Стоимость;
			Движение.СодержаниеПроводки = "Возвращены товары владельцу";
			Движение.Организация = Организация;
			
		Иначе 	
			
			Движение = Движения.Проводки.Добавить();
			Движение.СчетДт = ПланыСчетов.Счета.ПокупателямОтгрузили;
			Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.СодержаниеПроводки = "Выручка от продажи";
			Движение.Организация = Организация;
			
			Движение = Движения.Проводки.Добавить();
			Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Стоимость;
			Движение.СодержаниеПроводки = "Себестоимость продажи";
			Движение.Организация = Организация;
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры




