&НаКлиенте
Процедура ЗаполнитьСубконто(Команда)
	ЗаполнитьСубконтоНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСубконтоНаСервере()

	//Как в методичке работать правильно не будет!!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроводкиОборотыДтКт.Регистратор КАК Регистратор,
	|	ПроводкиОборотыДтКт.НомерСтроки,
	|	ПроводкиОборотыДтКт.СубконтоКт1 КАК Товар
	|ИЗ
	|	РегистрБухгалтерии.Проводки.ОборотыДтКт(,, Запись, СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Капитал),,
	|		СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары),,) КАК ПроводкиОборотыДтКт
	|ИТОГИ
	|ПО
	|	Регистратор";

	РезультатЗапроса = Запрос.Выполнить();

	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);

	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока (ВыборкаРегистратор.Следующий() = Истина) Цикл

		ДокументСсылка = ВыборкаРегистратор.Регистратор;

		Проводки = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
		Проводки.Отбор.Регистратор.Установить(ДокументСсылка);

		Проводки.Прочитать();

		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			Проводка = Проводки.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			Если (Проводка.СчетДт = ПланыСчетов.Бухгалтерский.Капитал И Проводка.СчетКт
				= ПланыСчетов.Бухгалтерский.Товары) Тогда

				Проводка.СубконтоДт.Номенклатура = ВыборкаДетальныеЗаписи.Товар;

			КонецЕсли;

			Если (Проводка.СчетДт = ПланыСчетов.Бухгалтерский.Покупатели И Проводка.СчетКт
				= ПланыСчетов.Бухгалтерский.Капитал) Тогда

				Проводка.СубконтоКт.Номенклатура = ВыборкаДетальныеЗаписи.Товар;

			КонецЕсли;
		КонецЦикла;
//		Если (Проводки.Модифицированность() = Истина) Тогда
		Проводки.Записать();
//		КонецЕсли;
	КонецЦикла;
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);

КонецПроцедуры