
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Блокировка = Новый БлокировкаДанных;
	
	ЧтоБлокируем = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	
	ЧтоБлокируем.УстановитьЗначение("Счет", ПланыСчетов.Счета.Поставщики);
	
	Блокировка.Заблокировать();
	
	
	Движения.Проводки.Записывать = Истина;
	Движения.Записать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкиОстатки.Счет,
		|	ПроводкиОстатки.Субконто1,
		|	ПроводкиОстатки.Субконто2,
		|	ПроводкиОстатки.Организация,
		|	ПроводкиОстатки.Подразделение,
		|	ПроводкиОстатки.Валюта,
		|	ПроводкиОстатки.СуммаОстатокДт,
		|	ПроводкиОстатки.СуммаОстатокКт,
		|	ПроводкиОстатки.СуммаВалютыОстатокДт,
		|	ПроводкиОстатки.СуммаВалютыОстатокКт
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет.Валютный = ИСТИНА, , Валюта <> &ПустаяВалюта и Валюта <> &НацВалюта) КАК ПроводкиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс
		|ПОМЕСТИТЬ ВТКурс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(
		|			&Период,
		|			Валюта В
		|				(ВЫБРАТЬ
		|					ВТОстатки.Валюта
		|				ИЗ
		|					ВТОстатки КАК ВТОстатки)) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.Счет,
		|	ВТОстатки.Субконто1,
		|	ВТОстатки.Субконто2,
		|	ВТОстатки.Организация,
		|	ВТОстатки.Подразделение,
		|	ВТОстатки.Валюта,
		|	ВТОстатки.СуммаОстатокДт,
		|	ВТОстатки.СуммаОстатокКт,
		|	ВТОстатки.СуммаВалютыОстатокДт,
		|	ВТОстатки.СуммаВалютыОстатокКт,
		|	ЕСТЬNULL(ВТКурс.Курс, 1) КАК Курс
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКурс КАК ВТКурс
		|		ПО ВТОстатки.Валюта = ВТКурс.Валюта";
	
	Запрос.УстановитьПараметр("Период", МоментВремени());
	Запрос.УстановитьПараметр("ПустаяВалюта", ПланыСчетов.Счета.ПустаяСсылка());
	Запрос.УстановитьПараметр("НацВалюта", Справочники.Валюты.РубльРФ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВалютаОстатокДт = ВыборкаДетальныеЗаписи.СуммаВалютыОстатокДт;
		
		ВалютаОстатокКт = ВыборкаДетальныеЗаписи.СуммаВалютыОстатокКт;
		
		
		СальдоРублиДт = ВалютаОстатокДт * ВыборкаДетальныеЗаписи.Курс;
		
		СальдоРублиКт = ВалютаОстатокКт * ВыборкаДетальныеЗаписи.Курс;
		
		Если СальдоРублиКт > 0 Тогда
			
			КурсоваяРазница =  СальдоРублиКт - ВыборкаДетальныеЗаписи.СуммаОстатокКт + ВыборкаДетальныеЗаписи.СуммаОстатокДт ;
			
			Если КурсоваяРазница > 0 Тогда
				
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ВыборкаДетальныеЗаписи.Счет;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
			Иначе
				
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = -1 * КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ВыборкаДетальныеЗаписи.Счет;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
			КонецЕсли;
			
		Иначе
			
			КурсоваяРазница =  СальдоРублиДт - ВыборкаДетальныеЗаписи.СуммаОстатокДт + ВыборкаДетальныеЗаписи.СуммаОстатокКт ;
			
			Если КурсоваяРазница > 0 Тогда
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма = КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ВыборкаДетальныеЗаписи.Счет;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
				
			Иначе
				Движение = Движения.Проводки.Добавить();
				
				Движение.Период = Дата;
				Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
				Движение.СодержаниеПроводки = "Курсовые разницы";
				Движение.Сумма =  -1 *КурсоваяРазница;
				
				//Дт
				
				Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Дт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Дт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Дт");
				
				//Кт
				
				Движение.СчетКт = ВыборкаДетальныеЗаписи.Счет;
				
				ОбщийМодульНаСервере.ЗаполнитьПодразделениеСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Подразделение, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 1, ВыборкаДетальныеЗаписи.Субконто1, "Кт");
				ОбщийМодульНаСервере.ЗаполнитьСубконтоСтороныПроводки(
				Движение, 2, ВыборкаДетальныеЗаписи.Субконто2, "Кт");
				
				ОбщийМодульНаСервере.ЗаполнитьВалютуСтороныПроводки(
				Движение, ВыборкаДетальныеЗаписи.Валюта, 0,"Кт");
				
				
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	КонецЦикла;

	Движения.Проводки.Записывать = Истина;
	
	
	
КонецПроцедуры


