//---
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОрганизацияПриИзмененииНаСервере();
	КорСчетПриИзмененииНаСервере();
	МестоХраненияДенежныхСредствПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ПФО_Организация", Объект.Организация));

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура КорСчетПриИзмененииНаСервере()

	ДанныеСчета = БухгалтерияВызовСервера.ПолучитьСвойствоСчета(Объект.КорСчет);

	Для Индекс = 1 По ДанныеСчета.МаксКоличествоСубконто Цикл

		Если (Индекс <= ДанныеСчета.КоличествоСубконто) Тогда

			Элементы["КорСубконто" + Индекс].Доступность = Истина;
			Элементы["КорСубконто" + Индекс].Заголовок = ДанныеСчета["ВидСубконто"
				+ Индекс + "Наименование"];
			Элементы["КорСубконто" + Индекс].ВыбиратьТип = Ложь;

			Объект["КорСубконто" + Индекс] = ДанныеСчета["ВидСубконто" + Индекс
				+ "ТипЗначения"].ПривестиЗначение(Объект.КорСубконто1);

		Иначе

			Элементы["КорСубконто" + Индекс].Доступность = Ложь;
			Элементы["КорСубконто" + Индекс].Заголовок = "Не определено";

			Объект["КорСубконто" + Индекс] = Неопределено;

		КонецЕсли;

	КонецЦикла;

	Если (ДанныеСчета.КоличествоСубконто = 2) Тогда

		Массив = Новый Массив;

		Если ТипЗнч(Объект.КорСубконто2) = Тип("СправочникСсылка.ЗначенияПользовательскихСубконто") Тогда

			Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеСчета.ВидСубконто2));

		ИначеЕсли ТипЗнч(Объект.КорСубконто2) = Тип("СправочникСсылка.Договоры") Тогда

			Массив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.КорСубконто1));
			Массив.Добавить(Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));

		КонецЕсли;

		Элементы.КорСубконто2.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	КорСчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МестоХраненияДенежныхСредствПриИзмененииНаСервере()

	Если (ПолучитьФункциональнуюОпцию("ВалютныйУчет",
	 Новый Структура("ПФО_Организация", Объект.Организация)) = Истина) Тогда

		ДанныеСчета = БухгалтерияВызовСервера.ПолучитьСвойствоСчета(Объект.МестоХраненияДенежныхСредств.СчетУчета);

		Если (ДанныеСчета.Валютный = Истина) Тогда
			Элементы.Валюта.Видимость = Истина
		Иначе
			Элементы.Валюта.Видимость = Ложь
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияДенежныхСредствПриИзменении(Элемент)
	
	МестоХраненияДенежныхСредствПриИзмененииНаСервере();
	
КонецПроцедуры




