
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	  ИзменитьАктивностьПроводок(ПараметрКоманды);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  СсылкаНаДокумент  - ДокументСсылка - Ссылка на документ Ручная операция
&НаСервере
Процедура ИзменитьАктивностьПроводок(СсылкаНаДокумент)

	Бухгалтерия.ИзменитьАктивностьДвижений(СсылкаНаДокумент);

	
	//НаборЗаписей = РегистрыБухгалтерии.Проводки.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Получить(0).Установить(СсылкаНаДокумент);
	////НаборЗаписей.Отбор.Регистратор.Установить(СсылкаНаДокумент);
	//
	//НаборЗаписей.Прочитать();
	//
	//Если НаборЗаписей.Количество() = 0 Тогда
	//
	//	  Возврат;
	//
	//КонецЕсли;

	//ТекущаяАктивность = НаборЗаписей[0].Активность;
	//
	//НаборЗаписей.УстановитьАктивность(Не ТекущаяАктивность);
	//
	//НаборЗаписей.Записать();
	
КонецПроцедуры // ИзменитьАктивностьПроводок()

