

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросСервер(ПолеТекста.ПолучитьТекст());
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросСервер(Текст)
	Запрос=Новый Запрос;
	Запрос.Текст=Текст;
	Запрос.УстановитьПараметр("ЗначениеСсылка",Объект.ЗначениеСсылка);
	Запрос.УстановитьПараметр("ЗначениеЧисло",Объект.ЗначениеЧисло);

	Макет = Обработки.ЗнакомствоСЗапросом.ПолучитьМакет("Макет");
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезультатЗапроса.Очистить();
	Область = Макет.ПолучитьОбласть("Значение");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Вход=Истина;
	Для Каждого Колонка Из Результат.Колонки Цикл
			
		ОблЗаголовок.Параметры.Значение=Колонка.Имя;
		Если Вход Тогда
			РезультатЗапроса.Вывести(ОблЗаголовок);
			Вход=Ложь;
		Иначе	
			РезультатЗапроса.Присоединить(ОблЗаголовок);
		КонецЕсли;
	КонецЦикла;	
	
	РезультатЗапроса.НачатьАвтогруппировкуСтрок();
	Пока Выборка.Следующий() Цикл
		Вход=Истина;
		Для Каждого Колонка Из Результат.Колонки Цикл
			
			Область.Параметры.ВыводимоеЗначение=Выборка[Колонка.Имя];
			Если Вход Тогда
				РезультатЗапроса.Вывести(Область,Выборка.Уровень());
				Вход=Ложь;
			Иначе	
				РезультатЗапроса.Присоединить(Область);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
		
	РезультатЗапроса.ЗакончитьАвтогруппировкуСтрок();	
	
	
КонецПроцедуры
