Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = Счет;

	Если (Движение.СчетДт.Валютный = Истина) Тогда

		Движение.ВалютаДт = Валюта;
		Движение.ВалютнаяСуммаДт = Сумма;

	КонецЕсли;

	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 1, Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, 2, Субконто2);

	Движение.СчетКт = ПланыСчетов.Бухгалтерский.Касса;

	Движение.ВалютаКт = Валюта;
	Движение.ВалютнаяСуммаКт = Сумма;

	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение.Организация = Организация;
	Движение.Сумма = БухгалтерияСервер.РассчитатьЭквивалент(Сумма, Валюта, Дата);
	Движение.Содержание = "Поступление денег";
	Движение.Период = Дата;

КонецПроцедуры
