
&НаКлиенте
Процедура УстановитьЗаголовкиИДоступностьСубконто()

	ДанныеСчета = БухгалтерияСерверПовторно.ПолучитьСвойствоСчета(Объект.Счет);
	
	Для Индекс = 1 По 2 Цикл
	
		Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
		
			Элементы["Субконто" + Индекс].Заголовок =
			ДанныеСчета["ВидСубконто" + Индекс + "Наименование"];
			
			Элементы["Субконто" + Индекс].Доступность = Истина;
		
		Иначе
		
			Элементы["Субконто" + Индекс].Заголовок = "Не задано";
			
			Элементы["Субконто" + Индекс].Доступность = Ложь;
			
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)

	УстановитьЗаголовкиИДоступностьСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьЗаголовкиИДоступностьСубконто();
	
КонецПроцедуры
