
&НаСервере
Процедура ПерепровестиНаСервере()

	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);
	
	Выборка = Документы.ПоступлениеТоваров.Выбрать(Период.ДатаНачала, Период.ДатаОкончания);
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Проведен Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ДокОбъект = Выборка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	
	КонецЦикла;
	
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Перепровести(Команда)
	ПерепровестиНаСервере();
	ПоказатьОповещениеПользователя("Перепроведение закончено ",,"Период "
	+ ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания, "ФП"));
КонецПроцедуры
