Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
	//	, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	//
	//	  Индекс = ПроверяемыеРеквизиты.Найти("Подразделение");
	//		ПроверяемыеРеквизиты.Удалить(Индекс);
	//		
	//
	//КонецЕсли;                      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	
	Движение = Движения.Проводки.Добавить();
	
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Выплатили денежные средства";
	
	Движение.СчетДт = КорСчет;
	Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");
	
	Движение.СчетКт = ?(Наличные, ПланыСчетов.Счета.Касса, ПланыСчетов.Счета.СчетВБанке);
	Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");
	
	Движения.Записать();
	
    //-------Проверка остатка -----
	
	Запрос = Новый Запрос;
	
	Если Движение.СчетКт.ПоПодразделениям Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкиОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(
		|			&Период,
		|			Счет = &СчетУчетаДС,
		|			,
		|			Организация = &Организация
		|				И Подразделение = &Подразделение) КАК ПроводкиОстатки
		|ГДЕ
		|	ПроводкиОстатки.СуммаОстатокДт < 0";
	
	Иначе
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкиОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = &СчетУчетаДС, , Организация = &Организация) КАК ПроводкиОстатки
		|ГДЕ
		|	ПроводкиОстатки.СуммаОстатокДт < 0";
		
	
	КонецЕсли;
	
	СчетУчетаДС = ?(Наличные, ПланыСчетов.Счета.Касса, ПланыСчетов.Счета.СчетВБанке);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("СчетУчетаДС", СчетУчетаДС);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нехватает денежных средств. Нехвакта " + ВыборкаДетальныеЗаписи.СуммаОстатокДт;
		Сообщение.Поле = "Сумма";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры
