
&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиНаСервере(Объект.ВыборПериода.ДатаНачала, Объект.ВыборПериода.ДатаОкончания);
	
	Пояснение = "Период - " + 
	ПредставлениеПериода(Объект.ВыборПериода.ДатаНачала, Объект.ВыборПериода.ДатаОкончания);
	
	ПоказатьОповещениеПользователя("Перепроведение закончено",,Пояснение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиНаСервере(НачалоПериода, КонецПериода)

	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);
	
	Выборка = Документы.ПоступлениеТоваров.Выбрать(НачалоПериода,КонецПериода);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
			
			ДокументОбъект = Выборка.ПолучитьОбъект();
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		КонецЕсли;
	
	КонецЦикла;
	
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);
	
КонецПроцедуры
