//Обработчики событий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭталонныйНабор, НаборКонстант);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если ЭталонныйНабор.СкладскойУчет <> НаборКонстант.СкладскойУчет Тогда

		ЭталонныйНабор.СкладскойУчет = НаборКонстант.СкладскойУчет;

		ОбработатьСубконтоСклады();

	КонецЕсли;

КонецПроцедуры

//Вспомогательные процедуры и функции
&НаСервере
Процедура ОбработатьСубконтоСклады()
//	
КонецПроцедуры

// ПриИзмененииУчетаПоСкладам()

