Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//
	//Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
	//	, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	//
	//	  Индекс = ПроверяемыеРеквизиты.Найти("Подразделение");
	//		ПроверяемыеРеквизиты.Удалить(Индекс);
	//		
	//
	//КонецЕсли;                      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Движение = Движения.Проводки.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Поступление денежных средств";
	
	
	
	Движение.СчетДт = МестоХраненияДенежныхСредств.СчетУчета;
	Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");
	
	Движение.СчетКт = ПланыСчетов.Счета.ПокупателямОтгрузили;
	Бухгалтерия.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");

КонецПроцедуры
