Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Проводки 
	Движения.Проводки.Записывать = Истина;
	Движение = Движения.Проводки.Добавить();
	
	Движение.СчетДт = ?(Наличные , ПланыСчетов.Счета.Касса ,
	ПланыСчетов.Счета.СчетВБанке);
	
	Движение.СчетКт = КорСчет;
	
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Поступление ДС";

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
