
//-------------
&НаКлиенте
Процедура ДвиженияПроводкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ДанныеРедактируемойСтроки = Элементы.ДвиженияПроводки.ТекущиеДанные;

	Если НоваяСтрока Тогда
		
		ДанныеРедактируемойСтроки.СодержаниеПроводки = Объект.СодержаниеОперации;
	
	КонецЕсли;
	
	
КонецПроцедуры

//-------------
&НаКлиенте
Процедура ДвиженияПроводкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	РассчитатьСуммуОперации();	
	
КонецПроцедуры

//-------------
&НаКлиенте
Процедура ДвиженияПроводкиПослеУдаления(Элемент)

	РассчитатьСуммуОперации();	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуОперации()

	 Объект.СуммаОперации = Объект.Движения.Проводки.Итог("Сумма");

 КонецПроцедуры 

