&НаСервере
Процедура ПоместитьФайлОбъекта(Адрес)
	Спр=РеквизитФормыВЗначение("Объект");
	ДвоичныеДанные=ПолучитьИзВременногоХранилища(Адрес);
	Спр.Фотография=Новый ХранилищеЗначения(ДвоичныеДанные);
	Спр.Записать();
	УдалитьИзВременногоХранилища(Адрес);
	АдресКартинки=Адрес;
	ЗначениеВРеквизитФормы(Спр,"Объект");
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Спр=РеквизитФормыВЗначение("Объект");
	Если Спр.Фотография.Получить()<>Неопределено Тогда
		АдресКартинки=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Перем Имя,Адрес;
	Если ПоместитьФайл(Адрес,"",Имя,Истина,ЭтаФорма.УникальныйИдентификатор) Тогда
		Объект.ИмяФайла=Имя;
		ПоместитьФайлОбъекта(Адрес);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура Выгрузить(Команда)
	АдресКартинки=ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография");
	ПолучитьФайл(АдресКартинки,Объект.ИмяФайла,Истина);
КонецПроцедуры

