Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПланСчетов.Ссылка КАК Ссылка,
		|	ПланСчетов.Наименование КАК Наименование
		|ИЗ
		|	ПланСчетов.Бухгалтерский КАК ПланСчетов
		|ГДЕ
		|	ПланСчетов.Забалансовый = ЛОЖЬ
		|	И ПланСчетов.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Склады)";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		СчетСсылка = ВыборкаДетальныеЗаписи.Ссылка;

		Попытка

			ЗаблокироватьДанныеДляРедактирования(СчетСсылка);

			СчетОбъект = СчетСсылка.ПолучитьОбъект();

			ВидыСубконтоСчета = СчетОбъект.ВидыСубконто;

			СтрокаВидыСубконтоСклад = ВидыСубконтоСчета.Найти(ПланыВидовХарактеристик.ВидыСубконто.Склады, "ВидСубконто");

			Если (Константы.СуммовойУчетПоСкладам.Получить() = Истина) Тогда

				СтрокаВидыСубконтоСклад.Суммовой = Истина;

			Иначе

				СтрокаВидыСубконтоСклад.Суммовой = Ложь;

			КонецЕсли;

			СчетОбъект.Записать();

		Исключение

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить признак учета субконто 
				|""Суммовой"" у субконто ""Склады"" счета "
				+ ВыборкаДетальныеЗаписи.Наименование;
			Сообщение.Сообщить();

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
