
&НаКлиенте
Процедура Провести(Команда)
	
	ПровестиНаСервере(Объект.ВыборПериода.ДатаНачала, Объект.ВыборПериода.ДатаОкончания);
	
	Пояснение = "Период - " + 
	ПредставлениеПериода(Объект.ВыборПериода.ДатаНачала, Объект.ВыборПериода.ДатаОкончания);
	
	ПоказатьОповещениеПользователя("Перепроведение закончено",,Пояснение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПровестиНаСервере(НачалоПериода, КонецПериода)

	Обработки.ПерепроведениеПоступленийТоваров.ПровестиПоступленияЗаПериод(НачалоПериода, КонецПериода);
	
КонецПроцедуры
