
Процедура ПровестиПоступленияЗаПериод(НачалоПериода, КонецПериода) Экспорт

	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);
	
	Выборка = Документы.ПоступлениеТоваров.Выбрать(НачалоПериода,КонецПериода);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
			
			ДокументОбъект = Выборка.ПолучитьОбъект();
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		КонецЕсли;
	
	КонецЦикла;
	
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);
	
КонецПроцедуры
