Функция ПолучитьСвойствоСчета(Счет) Экспорт

	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Забалансовый", Счет.Забалансовый);
	ДанныеСчета.Вставить("УчетПоПодразделениям", Счет.УчетПоПодразделениям);
	ДанныеСчета.Вставить("Количественный", Счет.Количественный);
	ДанныеСчета.Вставить("Валютный", Счет.Валютный);
	ДанныеСчета.Вставить("КоличествоСубконто", Счет.ВидыСубконто.Количество());
	//и другие свойства счета

	МаксКоличествоСубконто = Метаданные.ПланыСчетов.Бухгалтерский.МаксКоличествоСубконто;
	Для Индекс = 1 По МаксКоличествоСубконто Цикл

		Если Индекс <= Счет.ВидыСубконто.Количество() Тогда

			ДанныеСчета.Вставить("ВидСубконто" + Индекс, Счет.ВидыСубконто[Индекс - 1].ВидСубконто);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Наименование", Счет.ВидыСубконто[Индекс - 1].ВидСубконто);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТипЗначения", Счет.ВидыСубконто[Индекс
				- 1].ВидСубконто.ТипЗначения);

		Иначе

			ДанныеСчета.Вставить("ВидСубконто" + Индекс, Неопределено);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "Наименование", Неопределено);
			ДанныеСчета.Вставить("ВидСубконто" + Индекс + "ТипЗначения", Неопределено);

		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеСчета;
КонецФункции // ()
