Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыПоДоговорам.Значение КАК Значение
		|ИЗ
		|	Константа.РасчетыПоДоговорам КАК РасчетыПоДоговорам";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.Значение <> ДополнительныеСвойства.ЗначениеДо Тогда

			Если ВыборкаДетальныеЗаписи.Значение = Истина Тогда
				ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты;
			Иначе
				ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры;
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
				|	СчетаВидыСубконто.Ссылка КАК Ссылка
				|ИЗ
				|	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
				|ГДЕ
				|	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";

			Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);

			РезультатЗапроса = Запрос.Выполнить();

			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл

				ПСОбъект = Выборка.Ссылка.ПолучитьОбъект();
				//	ПСОбъект = ПланыСчетов.Счета.СоздатьСчет();
				Если ВыборкаДетальныеЗаписи.Значение = Истина Тогда
				//Добавить
					Если ПСОбъект.ВидыСубконто.Количество() = 2 Тогда

						Продолжить;

					КонецЕсли;

					НоваяСтрока = ПСОбъект.ВидыСубконто.Добавить();
					НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры;

				Иначе
				//Удалить
					СтрокаДляУдаления = ПСОбъект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры, "ВидСубконто");

					ПСОбъект.ВидыСубконто.Удалить(СтрокаДляУдаления);

				КонецЕсли;

				ПСОбъект.Записать();

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	РасчетыПоДоговорам.Значение КАК Значение
		|ИЗ
		|	Константа.РасчетыПоДоговорам КАК РасчетыПоДоговорам";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДополнительныеСвойства.Вставить("ЗначениеДо", ВыборкаДетальныеЗаписи.Значение);

	КонецЦикла;

КонецПроцедуры
