Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Касса;

	Движение.ВалютаДт = Валюта;
	Движение.ВалютнаяСуммаДт = Сумма;

	Движение.СчетКт = Счет;
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 1, Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, 2, Субконто2);

	ДанныеСчета = БухгалтерияСерверПовторно.ПолучитьСвойствоСчета(Движение.СчетКт);

	Если (ДанныеСчета.Валютный = Истина) Тогда
		
		Движение.ВалютаКт = Валюта;
		Движение.ВалютнаяСуммаКт = Сумма;

	КонецЕсли;

	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение.Организация = Организация;
	Движение.Сумма = БухгалтерияСервер.РассчитатьЭквивалент(Сумма, Валюта, Дата);
	Движение.Содержание = "Поступление денег";
	Движение.Период = Дата;

КонецПроцедуры
